var app = angular.module('myApp', []);
app.controller('myCtrl', function($scope) {
	$scope.names = [];
	$scope.names[0] = "رنگ های تیره";
	$scope.names[1] = "پاستل";
	$scope.names[2] = "ترکیبی";
	$scope.names[3] = "قرمز";
	$scope.names[4] = "صورتی";
	$scope.names[5] = "سفید";
	$scope.names[6] = "زرد";
	$scope.names[7] = "نارنجی";
	$scope.names[8] = "زمستان";
	$scope.names[9] = "بهار";
	$scope.names[10] = "تابستان";
	$scope.names[11] = "پاییز";
	$scope.names[12] = "موی بلوند و چشم آبی";
	$scope.names[13] = "موی بلوند و چشم سبز";
	$scope.names[14] = "موی بلوند و چشم قهوه ای";
	$scope.names[15] = "موی بلوند و چشم خاکستری";
	$scope.names[16] = "موی قهوه ای و چشم آبی";
	$scope.names[17] = "موی قهوه ای و چشم سبز";
	$scope.names[18] = "موی قهوه ای و چشم قهوه ای";
	$scope.names[19] = "موی قهوه ای و چشم خاکستری";
	$scope.names[20] = "موی قرمز و چشم آبی و خاکستری";
	$scope.names[21] = "موی قرمز و چشم سبز و قهوه ای";
	$scope.names[22] = "موی مشکی";
	
	$scope.data = [];
	$scope.data[0] = "رنگ های تیره از قبیل مشکی و آبی تیره مخابره کننده قدرت و صلابت می باشند. سعی کنید رنگ آبی ای را انتخاب نمایید که با رگهای مچ دستتان همرنگ باشد.";
	$scope.data[1] = "رنگهای آرامش بخش، ملایم و طبیعی (پررنگ نباشند) شما را آرام و دوستانه نشان می دهند. رنگهایی مانند سبز روشن و ارغوانی روشن.";
	$scope.data[2] = "ترکیب کردن رنگهای مختلف این پیام را مخابره می نماید که شما انسان خلاقی هستید. مطمئن شوید رنگ هایی که استفاده می کنید با یکدیگر همخوانی دارند و ترکیب خوشایندی را ایجاد می نمایند مانند قرمز و ارغوانی.";
	$scope.data[3] = "طیف رنگ های قرمز نشان دهنده رفتارها و خصوصیات شخصی شما می باشند و هرکدام پیام های خاصی را مخابره می نمایند. رنگ های کبود نشان دهنده پیچیدگی فرد می باشد درحالی که قرمز-آبی نشان دهنده تلاش فرد برای ابراز وجود می باشد.رنگهای قرمز-نارنجی توسط افراد پر جنب و جوش استفاده می شود.رنگ های قرمزی که هنگام به هیجان آمدنتان، همرنگ پوست شما هستند بسیار رمانتیک می باشند.";
	$scope.data[4] = "رنگ های صورتی نشان دهنده مهربانی است. فارغ از جنسیت، افرادی که رنگ صورتی می پوشند دوست داشتنی و دوست دار دیگران به نظر می آیند.";
	$scope.data[5] = "لباس های روشن (نزدیک به سفید) نماد یک شروع تازه اند. این رنگها شما را تمیز، بانشاط و درخشان جلوه می دهد. رنگ های طیف سفید، قهوه و زرد-قهوه ای که به رنگ پوست شما نزدیک اند (همرنگ نباشند) شمارا خارق العاده نشان خواهند داد.";
	$scope.data[6] = "رنگ های زرد گرما و خوش بینی را به بیننده القا می کنند. این رنگ ها گرمای نور خورشید را به یاد می آورند و به دلیل نزدیکی با آن نماد خوشبینی و گرما هستند.";
	$scope.data[7] = "رنگ نارنجی نشان دهنده انرژِی بالای شماست. این رنگ می تواند شما را انسانی شوخ به نظر آورد. این رنگ یکی از رنگ هاییست که انرژی جنسی زیادی را به نمایش می گذارد.";
	$scope.data[8] = "اگر موهای مشکی یا خرمایی دارید، رنگ های زمستانی را انتخاب کنید. افرادی که رنگ شان زمستانی است، موهای مشکی یا خرمایی به همراه پوست کم رنگ (رنگ پریده) یا زیتونی دارند. این افراد باید از رنگ های غنی و عمیق استفاده کنند.";
	$scope.data[9] = "اگر پوستی کم رنگ (رنگ پریده) دارید از رنگ های بهاری استفاده کنید. افرادی که چشم یا پوستی کم رنگ و حتی موهای بلوند مایل به نقره ای و یا به رنگ توت فرنگی دارند، رنگشان بهاری است. این گروه در لباس هایی بارنگ های روشن بهترین ظاهر را دارند.";
	$scope.data[10] = "اگر موهایتان بلوند است از رنگ های تابستانی استفاده کنید. افرادی که رنگ تابستانی دارند موهای بلوند و پوستی رنگ پریده دارند. این گروه باید از رنگ های سنگین و خاموش استفاده کند.";
	$scope.data[11] = "اگر پوست سرخی دارید از رنگهای پاییزی استفاده کنید. این افراد موهای قرمز، سیاه یا ترکیبی از بلوند و قهوه دارند و معمولا پوستشان به سرخی میزند. این گروه بهتر است رنگهای نارنجی، قهوه ای و سبز زیتونی استفاده کنند.";
	$scope.data[12] = "اگر مو بور و چشم آبی هستید:  برای شما رنگ های آبی، سبز-آبی، سبز روشن و فیروزه ای بسیار تحسین بر انگیزند.";
	$scope.data[13] = "اگر مو بور و چشم سبز هستید:  برای شما رنگ های سبز، نارنجی و آبی جذاب هستند.";
	$scope.data[14] = "اگر مو بلوند و چشم فندقی/قهوه ای هستید: برای شما رنگ های قهوه ای، ارغوانی، قرمز، صورتی و نارنجی ایده آل هستند.";
	$scope.data[15] = "اگر مو بلوند و چشم خاکستری هستید: برای شما هر رنگی بجز زرد روشن مناسب است.";
	$scope.data[16] = "اگر مو قهوه ای و چشم آبی هستید: برای شما رنگ های قرمز، نارنجی، صورتی و زرد زیباست.";
	$scope.data[17] = "اگر مو قهوه ای و چشم سبز هستید: تمام تقسیم بندی های قبل و سبز خوب است.";
	$scope.data[18] = "اگر مو قهوه ای و چشم فندقی/قهوه ای هستید: رنگ های تیره و زمینی و آبی روشن خوش تیپتان می کند.";
	$scope.data[19] = "اگر مو قهوه ای و چشم خاکستری هستید: برای شما اقسام رنگ آبی، ارغوانی، مشکی و خاکستری فوق العاده استند.";
	$scope.data[20] = "اگر مو قرمز و چشم خاکستری/ آبی هستید: برای شما رنگ های نارنجی روشن ، ارغوانی، مشکی و سبز جذاب هستند.";
	$scope.data[21] = "اگر مو قرمز و چشم سبز/فندقی/قهوه ای هستید: اقسام مختلف رنگ ارغوانی، سبز تیره یا روشن، مشکی و رنگ های زمینی باحال هستند.";
	$scope.data[22] = "اگر موی سیاه دارید: با هر رنگی زیبا به نظر می رسید.";

	$scope.colors = [];
	$scope.colors[0] = ["30295c", "4f4794", "412f79"];
	$scope.colors[1] = ["eed5bf", "dfe1ba", "dfdced"];
	$scope.colors[2] = ["a92962", "e7456a", "e51875"];
	$scope.colors[3] = ["90251f", "e7456a", "e2794c"];
	$scope.colors[4] = ["ed7196", "f5b7ce", "f5acca"];
	$scope.colors[5] = ["e4e0ef", "c9ddf5", "f0f3d6"];
	$scope.colors[6] = ["fbd5a6", "fef7b1", "feec00"];
	$scope.colors[7] = ["d6701e", "f4af36", "d68e15"];
	$scope.colors[8] = ["9b2420", "e4097f", "393186", "0c4727"];
	$scope.colors[9] = ["e7ddd1", "dfdced", "e9ecd1", "eed5bf"];
	$scope.colors[10] = ["d2b68f", "c7c4d7", "cbccaa", "dbbca0"];
	$scope.colors[11] = ["f5ad72", "866520", "bdc36d", "e8bb94"];
	$scope.colors[12] = ["57b2b3", "73c5b9", "008dd2"];
	$scope.colors[13] = ["4396c0", "009746", "ef7f1b"];
	$scope.colors[14] = ["c7212b", "ed7493", "76492a", "ef7f1b"];
	$scope.colors[15] = ["76492a", "57b2b3", "ed7493"];
	$scope.colors[16] = ["c7212b", "ed7493", "ef7f1b", "f8da56"];
	$scope.colors[17] = ["f8da56", "ef7f1b", "c7212b", "afcb1f"];
	$scope.colors[18] = ["a2d9f7", "b7cad8", "5f5a46", "828773"];
	$scope.colors[19] = ["b7cad8", "4277bb", "303a44", "7f70b1"];
	$scope.colors[20] = ["ab252e", "f09546", "424242", "68902d"];
	$scope.colors[21] = ["afcb1f", "1a7347", "98a27f", "7f70b1"];
	$scope.colors[22] = ["ab252e", "65c3cf", "ed7493", "008dd2"];

	$scope.hair_type = [0,2,2,2,4,4,6,6,6,1,1,5,5,5,5,5,5,3,3];
	$scope.eye_type = [0,1,2,3,4,4,4];

	$scope.eye_dominant = [];
	$scope.eye_dominant[0] = ['','warm','warm','warm','warm'];
	$scope.eye_dominant[1] = ['','clear','deep','deep','clear'];
	$scope.eye_dominant[2] = ['','cool','cool','cool','cool'];
	$scope.eye_dominant[3] = ['','deep','deep','soft','clear'];
	$scope.eye_dominant[4] = ['','soft','soft','soft','light'];
	$scope.eye_dominant[5] = ['','soft','soft','soft','light'];

	$scope.pages = [];
	$scope.pages[0] = 'پیام رنگ ها';
	$scope.pages[1] = 'رنگ فصل';
	$scope.pages[2] = 'رنگ مو و چشم';

	$scope.pages_type2 = ['مشاوره لباس'];

	$scope.page_elements = [];
	$scope.page_elements[0] = [0,1,2,3,4,5,6,7];
	$scope.page_elements[1] = [8,9,10,11];
	$scope.page_elements[2] = [12,13,14,15,16,17,18,19,20,21,22];
	
	$scope.level1_func = function(number) {  
		$scope.level1_number = number;
	}

	$scope.level2_func = function(number) {  
		$scope.level2_number = number;
	}

	$scope.hair_func = function(number) {  
		$scope.hair_number = number;
	}

	$scope.eye_func = function(number) {  
		$scope.eye_number = number;
	}

	$scope.range = function(min, max, step){
    step = step || 1;
    var input = [];
    for (var i = min; i <= max; i += step) input.push(i);
    return input;
  };

});

function page(page_number) {
	for(i=1;i<=6;i++) {
		if(i===page_number) {
			document.getElementById('page'+i).style.display='block';
		} else {
			document.getElementById('page'+i).style.display='none';
		}
		
	}
}